int/resources/objectRepo/xmlTemplates/opera/CashieringConfig/req_CreateCashiers.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/mdm/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:CreateCashiersRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:Cashiers>
            <v91:Cashier Inactive="?">
               <v91:CashierID/>
               <v91:CurrencyCode/>
               <v91:Name/>
               <v91:AttachedUser/>
               <v91:CashierType/>
               <v91:StartingAmount/>
               <v91:FloatOverShort/>
               <v91:UsageInfo>
                  <v91:MaximumDailyUses/>
                  <v91:History>
                     <v91:LastOpened/>
                     <v91:TimesOpened/>
                  </v91:History>
               </v91:UsageInfo>
            </v91:Cashier>
         </v9:Cashiers>
      </v9:CreateCashiersRQ>
   </soapenv:Body>
</soapenv:Envelope>